:PROPERTIES:
:ID:       e2b80b87-a52c-4bc7-8132-8e391e3bce3a
:END:
#+TITLE:     Steam
#+AUTHOR:    David Conner
#+EMAIL:     noreply@te.xel.io
#+DESCRIPTION: notes

#+begin_quote
jesus !@#$'ing christ I just need to buy a Steam Deck.

oh right, i forgot. my career was assassinated. I almost forgot, but there it is
again to remind me.
#+end_quote

**** Reconciling multiple Steam Libraries

Steam stores +json+ =BML= in =.vdf= files. BML stands for =butts markup language=

#+begin_src shell :results output verbatim
find /flatpak/steam/SteamLibrary/ -name '*.vdf' -printf '%p\n'  | tree --fromfile .
#+end_src

#+RESULTS:
#+begin_example
.
└── flatpak
    └── steam
        └── SteamLibrary
            ├── compatibilitytools.d
            │   ├── GE-Proton7-24
            │   │   ├── compatibilitytool.vdf
            │   │   └── toolmanifest.vdf
            │   └── GE-Proton7-29
            │       ├── compatibilitytool.vdf
            │       └── toolmanifest.vdf
            ├── libraryfolder.vdf
            └── steamapps
                ├── common
                │   ├── Proton - Experimental
                │   │   └── toolmanifest.vdf
                │   ├── SteamLinuxRuntime_sniper
                │   │   └── toolmanifest.vdf
                │   └── SteamLinuxRuntime_soldier
                │       └── toolmanifest.vdf
                └── compatdata
                    ├── 1091500
                    │   └── pfx
                    │       └── drive_c
                    │           ├── Program Files (x86)
                    │           │   └── Steam
                    │           │       └── steamapps
                    │           │           └── libraryfolders.vdf
                    │           └── users
                    │               └── steamuser
                    │                   └── Saved Games
                    │                       └── CD Projekt Red
                    │                           └── Cyberpunk 2077
                    │                               └── steam_autocloud.vdf
                    ├── 948740
                    │   └── pfx
                    │       └── drive_c
                    │           ├── Program Files (x86)
                    │           │   └── Steam
                    │           │       └── steamapps
                    │           │           └── libraryfolders.vdf
                    │           └── users
                    │               └── steamuser
                    │                   └── AppData
                    │                       └── Local
                    │                           └── SpikeChunsoft
                    │                               └── AI The Somnium Files
                    │                                   └── steam_autocloud.vdf
                    └── 990050
                        └── pfx
                            └── drive_c
                                └── Program Files (x86)
                                    └── Steam
                                        └── steamapps
                                            └── libraryfolders.vdf

42 directories, 13 files
#+end_example

